```google_compute_instance.workernode[2]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-2]
google_compute_instance.workernode[1]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-1]
google_compute_instance.workernode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-0]
google_compute_instance.controlnode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/controlnode-0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.workernode[0] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-0"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[1] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-1"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-1"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[2] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-2"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-2"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.controlnode[0] has been changed
  ~ resource "google_compute_instance" "controlnode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/controlnode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "controlnode-0"
      + resource_policies    = []
        tags                 = [
            "controlnode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.controlnode[1] will be created
  + resource "google_compute_instance" "controlnode" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-small"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "controlnode-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "controlnode",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "europe-west4-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```